[{"name":"Phython","price":"250","icon":"fab fa-python fa-4x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Python_logo_and_wordmark.svg/1200px-Python_logo_and_wordmark.svg.png","description":"This course aims to teach everyone the basics of programming computers using Python. We cover the basics of how one constructs a program from a series of simple instructions in Python. The course has no pre-requisites and avoids all but the simplest mathematics. Anyone with moderate computer experience should be able to master the materials in this course. This course will cover Chapters 1-5 of the textbook \"Python for Everybody\"","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"C Programming","price":"100","icon":"fab fa-cuttlefish fa-4x","img":"https://www.codesansar.com/storage/app/media/seo/c-programming.jpg","description":"In this course, you will learn the principles of C programming and start coding hands-on in a browser tool that will provide instant feedback on your code.","duration":"Estimated 5 weeks.(2–3 hours per week)"},{"name":"Java","price":"250","icon":"fab fa-java fa-4x","img":"https://www.gcreddy.com/wp-content/uploads/2021/07/Java-Programming-Language.png","description":"This course is designed to provide students the basic skills and knowledge on Java.Learn how to solve programming problems using functions, for loops, conditional statements, recursive algorithms, and learn about the Object-Oriented Paradigm (OPP)","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"Javascript","price":"200","icon":"fab fa-js-square fa-4x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/2048px-Unofficial_JavaScript_logo_2.svg.png","description":"JavaScript is the programming language of the World Wide Web.As a professional web software developer, you will not only need to know how to program in this simple yet powerful language, but you will need to understand the fundamentals of how data is exchanged on the World Wide Web (WWW) and what tools and frameworks are available to you for creating robust, interactive web applications.","duration":"Estimated 4 weeks.(2–4 hours per week)"},{"name":"PHP","price":"200","icon":"fab fa-php fa-4x","img":"https://kinsta.com/wp-content/uploads/2020/03/php-tutorials-1024x512.png","description":"You will learn to create a (CMS) Content Management System like WordPress, Drupal or Joomla.You will learn how to use Databases.You will learn MySQL.Object Oriented Programming.You will learn how to launch your application online.How to use forms to submit data to databases.How to use AJAX to submit data to the server without refreshing the page.You will learn about PHP security.You will learn about sessions.Password hashing.Email sending","duration":"Estimated 4 weeks.(2–4 hours per week)"},{"name":"SQL","price":"180","icon":"fas fa-layer-group fa-2x","img":"https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTZyJUeJTh540jkFSa5Xw_obiAyF1GYuVbbRQ&usqp=CAU","description":"SQL (Structured Query Language) is the most commonly used language to communicate with databases and extract data for application development, reporting, and analytics. It is ubiquitous for industries across the world and a vital skill for aspiring data professionals to have. This course will introduce you to the SQL language and give you the skills you need to query and analyze data from complex relational databases.","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"React-Js","price":"150","icon":"fab fa-react fa-2x","img":"https://www.mobinius.com/wp-content/uploads/2020/02/reactjs-2.png","description":"React. js is an open-source JavaScript library that is used for building user interfaces specifically for single-page applications. Its used for handling the view layer for web and mobile apps. React also allows us to create reusable UI components","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"Node.js","price":"170","icon":"fab fa-node fa-2x","img":"https://upload.wikimedia.org/wikipedia/commons/d/d9/Node.js_logo.svg","description":"Node.js is designed for frontend or back-end developers who would like to become more familiar with the fundamentals of Node.js and its most common use cases. Before enrolling, students should know how to use a command line terminal, and have some familiarity with JavaScript.In this course, you will learn how to rapidly build command line tools, mock RESTful JSON APIs and prototype real-time services. ","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"Laravel","price":"150","icon":"fab fa-laravel fa-2x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Laravel.svg/1200px-Laravel.svg.png","description":"Laravel is a web application framework with expressive, elegant syntax.Laravel attempts to take the pain out of development by easing common tasks used in the majority of web projects, such as authentication, routing, sessions, and caching.","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"HTML","price":"100","icon":"fab fa-html5 fa-4x","img":"https://play-lh.googleusercontent.com/85WnuKkqDY4gf6tndeL4_Ng5vgRk7PTfmpI4vHMIosyq6XQ7ZGDXNtYG2s0b09kJMw=s1200","description":"HTML5 is the standard language of the Web, developed by W3C. For application developers and industry, HTML5 represents a set of features that people are able to rely on for years to come. HTML5 is supported on a wide variety of devices, lowering the cost of creating rich applications to reach users everywhere.","duration":"Estimated 3 weeks.(2–3 hours per week)"},{"name":"CSS","price":"110","icon":"fab fa-css3 fa-2x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/CSS3_logo_and_wordmark.svg/1200px-CSS3_logo_and_wordmark.svg.png","description":"In this course, we guide you step-by-step in using the latest Web standards to structure your content and presentation like a professional. You will explore numerous CSS features to help you control the look and feel of your site such as colors, fonts and layout. By the end of the course, you should understand all the fundamental elements of CSS and how to use them effectively.","duration":"Estimated 4 weeks.(2–4 hours per week)"},{"name":"Angular","price":"170","icon":"fab fa-angular fa-2x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Angular_full_color_logo.svg/1200px-Angular_full_color_logo.svg.png","description":"Angular is a platform and framework for building single-page client applications using HTML and TypeScript. Angular is written in TypeScript. It implements core and optional functionality as a set of TypeScript libraries that you import into your applications","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":".Net","price":"180","icon":"fab fa-battle-net fa-2x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/.NET_Core_Logo.svg/2048px-.NET_Core_Logo.svg.png","description":"NET Framework is a platform for building software. It is not a language itself. The primary (but not only) languages developers use to build software on the . NET Framework are C# and Visual Basic","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"Ionic","price":"160","icon":"far fa-dot-circle fa-2x","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Ionic-logo-landscape.svg/1200px-Ionic-logo-landscape.svg.png","description":"Ionic framework is an open-source UI toolkit for building performant, high-quality mobile apps, desktop apps, and progressive web apps using web technologies such as HTML, CSS, and JavaScript. It allows developers to build once and run everywhere.","duration":"Estimated 7 weeks.(2–4 hours per week)"},{"name":"Django","price":"180","icon":"","img":"https://hackr.io/blog/what-is-django-advantages-and-disadvantages-of-using-django/thumbnail/large","description":"Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. Built by experienced developers, it takes care of much of the hassle of web development, so you can focus on writing your app without needing to reinvent the wheel.","duration":"Estimated 7 weeks.(2–4 hours per week)"}]